# Data Merging

In [3]:
#import libraries
import pandas as pd

In [15]:
data1 = {
    'id' : [1,2,3],
    'name' : ['Haris', 'Zeeshan', 'Javed'],
    'age' : [28,7, 20]
}

data1 = pd.DataFrame(data1)
data1.head()

   id     name  age
0   1    Haris   28
1   2  Zeeshan    7
2   3    Javed   20

In [16]:
data2 = {
    'id' : [1,2,3],
    'city' : ['Lahore', 'Sargodha', 'Karchi'],
    'occupation' : ['Engineer', 'Developer', 'Doctor']
}
data2 = pd.DataFrame(data2)
data2.head()

   id      city occupation
0   1    Lahore   Engineer
1   2  Sargodha  Developer
2   3    Karchi     Doctor

In [18]:
merged_data = pd.merge(data1, data2, on= 'id', how= 'inner')
merged_data.head()

   id     name  age      city occupation
0   1    Haris   28    Lahore   Engineer
1   2  Zeeshan    7  Sargodha  Developer
2   3    Javed   20    Karchi     Doctor